---
kind: property
id: P:Autodesk.Revit.DB.MultiSegmentGrid.Text
source: html/8ec5e47a-8821-5d3c-0951-33d051a58b96.htm
---
# Autodesk.Revit.DB.MultiSegmentGrid.Text Property

name shared by grids in this MultiSegmentGrid

## Syntax (C#)
```csharp
public string Text { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null